/**
 * @brief Модуль интеграции и экспорта.
 */
class IntegrationAndExportModule {
public:
    /**
     * @brief Предоставляет поддержку различных форматов файлов.
     * 
     * Метод содержит функционал для экспорта и импорта файлов в популярные форматы,
     * обеспечивая совместимость с другими программами.
     */
    void fileFormatSupport();

    /**
     * @brief Предоставляет возможность использования плагинов и расширений.
     * 
     * Метод содержит архитектуру, позволяющую расширять функционал через сторонние плагины и скрипты
     * для решения специализированных задач.
     */
    void pluginsAndExtensions();
};