/**
 * @brief Модуль анимации и движения.
 */
class AnimationAndMotionModule {
public:
    /**
     * @brief Предоставляет систему скелетной анимации.
     * 
     * Метод содержит инструменты для создания и редактирования скелетов, весов вершин и анимационных клипов.
     */
    void skeletonAnimationSystem();

    /**
     * @brief Предоставляет инструменты для морфинга и динамической анимации.
     * 
     * Метод содержит средства для морфинга и создания сложных анимаций на основе физических свойств объектов.
     */
    void morphingAndDynamicAnimation();

    /**
     * @brief Предоставляет инструменты для симуляции тканей и жидкостей.
     * 
     * Метод содержит инструменты для создания реалистичных анимаций тканей, воды, огня и дыма.
     */
    void clothAndFluidSimulation();
};