/**
 * @brief Модуль эффектов и симуляции.
 */
class EffectsAndSimulationModule {
public:
    /**
     * @brief Предоставляет инструменты для создания частиц и спецэффектов.
     * 
     * Метод содержит систему частиц для создания разнообразных визуальных эффектов,
     * таких как дождь, снег, искры и другие.
     */
    void particleEffects();

    /**
     * @brief Предоставляет инструменты для динамической симуляции.
     * 
     * Метод содержит средства для моделирования реалистичного поведения твердых тел, жидкостей,
     * тканей и взаимодействия между ними.
     */
    void dynamicSimulation();
};