/**
 * @brief Модуль текстурирования и материалов.
 */
class TexturingAndMaterialsModule {
public:
    /**
     * @brief Предоставляет редактор материалов.
     * 
     * Метод содержит инструменты для создания и настройки материалов,
     * включая настройку параметров отражения, преломления и прозрачности.
     */
    void materialEditor();

    /**
     * @brief Предоставляет инструменты для работы с UV-разверткой.
     * 
     * Метод содержит инструменты для эффективного размещения текстур на 3D объектах,
     * включая автоматическую и ручную развертку UV-координат.
     */
    void uvUnwrappingTools();

    /**
     * @brief Поддерживает PBR-материалы.
     * 
     * Метод обеспечивает реализацию физически корректных материалов, обеспечивая реалистичное взаимодействие с освещением.
     */
    void pbrMaterialSupport();
};